[
  {
    "id": 1,
    "title": "2D컴퓨터그래픽",
    "subtitle": "디지털 조형의 기초 이론 학습과 시각 디자인 프로세스에 필요한 Photoshop, Illustrator 등의 툴에 대한 기초 실습을 통해 작품 제작 능력을 향상시킨다.",
    "credit": "전공기초",
    "price": 3,
    "grade": "1",
    "badge": null
  },
  {
    "id": 2,
    "title": "GUI",
    "subtitle": "GUI에 대한 개념과 디자인 프로세스에 대해 학습하고 하드웨어적인 측면과 소프트웨어적인 측면에서의 GUI접근법 차이에 대해 학습하여 인간공학적 측면으로의 GUI설계가 가능하도록 함을 목표로 한다.",
    "credit": "전공선택",
    "price": 3,
    "grade": "2",
    "badge": null
  },
  {
    "id": 3,
    "title": "HCI개론",
    "subtitle": "HCI개론은 다양한 인간중심의 상호작용에 대해 학습하고, 인지적 특성과 휴먼에러 예방을 위한 인터랙션 디자인의 원리에 대해 이해하고 실습한다.",
    "credit": "전공선택",
    "price": 3,
    "grade": "1",
    "badge": null
  },
  {
    "id": 4,
    "title": "UX디자인 사례분석",
    "subtitle": "사용자 경험에 대한 정의와 개념을 학습하고 실제 사용자 경험디자인에 대한 사례분석을 통해 불편함을 인지하고 더 나은 사용자 경험에 대해 모색한다.",
    "credit": "전공선택",
    "price": 3,
    "grade": "3",
    "badge": null
  },
  {
    "id": 5,
    "title": "기초입체디자인",
    "subtitle": "조형연습은 종이및 다양한 소재를 통해 입체의 기본적인 조형요소와 디자인 발상의 조형원리를 이해하고, 3차원 공간에서의 조형 분석 및 실습을 통해, 구조, 공간, 재료에 관한 입체조형 능력과 디자인발상 능력을 기른다.",
    "credit": "전공필수",
    "price": 3,
    "grade": "1",
    "badge": null
  },
  {
    "id": 6,
    "title": "모션그래픽",
    "subtitle": "영상 실무에서 사용하는 대표적인 작업 프로그램 툴인 Adobe After Effects의 기능에 대해 심화적으로 익히고 활용하여 모션그래픽에 대해 학습한다.",
    "credit": "전공선택",
    "price": 3,
    "grade": "3",
    "badge": null
  },
  {
    "id": 7,
    "title": "미디어스토리텔링디자인",
    "subtitle": "본 교과목은 다양한 미디어의 융합 시대에 있어, 보다 창의적이고 미래 지향적인 미디어 콘텐츠 창작을 위한 스토리텔링의 개념과 특징, 방법에 대해 이해하고 이를 콘텐츠 디자인에 적용시킬 수 있는 능력을 함양하는 실습 중심 교과목이다.",
    "credit": "전공선택",
    "price": 3,
    "grade": "2",
    "badge": null
  },
  {
    "id": 8,
    "title": "브랜드디자인",
    "subtitle": "일관된 브랜드 경험을 위해서는 브랜드다움이 견고하게 정의되어야 하며, 이는 효과적이고 창의적인 시각적 표현으로 연결되어야 합니다. 시각커뮤니케이션에서의 브랜딩은 로고와 같은 단순한 시각적 무언가를 만드는 행위 그 이상으로, 브랜드의 가치를 정의하고 경험을 통한 다차원적 커뮤니케이션이 가능합니다. 본 수업은 브랜드디자인의 개념, 역할, 방법론을 탐구하는 것을 목표합니다.",
    "credit": "전공선택",
    "price": 3,
    "grade": "3",
    "badge": null
  },
  {
    "id": 9,
    "title": "브랜드전략",
    "subtitle": "본 교과목은 브랜딩을 위한 전략이론과 실무 프로세스를 이해하고 이론을 통하여 방법 및 브랜드 전략을 배웁니다. 다양한 사례분석 및 리서치를 통해 이론과 방법론을 익히며 브랜딩 전략 및 디자인에 필요한 종합적 사고역량으로 문제를 분석, 파악하고 해결하는 방법을 배우는 수업입니다.",
    "credit": "전공필수",
    "price": 3,
    "grade": "2",
    "badge": null
  },
  {
    "id": 10,
    "title": "사용자경험 프로토타이핑",
    "subtitle": "사용자 경험 프로토타이핑 사용자 경험을 분석하여 페인포인트(Paint Point)와 니즈(Needs)를 도출하고 이를 사용자 인터페이스에 담아내는 과정을 학습한다. 사용자 경험 디자인에 대한 이론적 학습을 기반으로, 사용자 경험을 분석하는 프로젝트를 수행하고, 모바일 앱 UI를 설계하기 위한 프로토타이핑을 제작한다.",
    "credit": "전공선택",
    "price": 3,
    "grade": "2",
    "badge": null
  },
  {
    "id": 11,
    "title": "사진촬영 스튜디오",
    "subtitle": "본 과목은 사진이라는 매체에 대한 기본적인 지식과, 사진촬영의 기본을 익힘으로써 자신의 의도와 방향을 창의적으로 표현하는 방법을 익히는 과목이다.",
    "credit": "전공선택",
    "price": 3,
    "grade": "전학년",
    "badge": null
  },
  {
    "id": 12,
    "title": "영상촬영 스튜디오",
    "subtitle": "카메라와 조명, 편집 및 색보정 등 후반 작업에서 활용되는 기술에 대한 기초 이론과 활용법을 익히고 클라이언트와의 커뮤니케이션 및 설득 과정에 대한 실무 교육을 진행한다. 이론만으론 배울 수 없는 현장 경험을 전달하고 자신만의 개성이 담긴 작업물을 만들어낼 수 있는 아이디에이션 방식에 대해 중점적으로 다룬다.",
    "credit": "전공선택",
    "price": 3,
    "grade": "전학년",
    "badge": null
  },
  {
    "id": 13,
    "title": "인포메이션디자인",
    "subtitle": "자신이 전달하려고 하는 정보를 디자인을 이용하여 쉽고 빠르고 정확하게 전달 할 수 있다.",
    "credit": "전공선택",
    "price": 3,
    "grade": "3",
    "badge": null
  },
  {
    "id": 14,
    "title": "타이포그래피",
    "subtitle": "타이포그래피의 역사, 원리, 용어, 기본 규칙 등에 대해 학습 한 후, 다양한 프로젝트를 통해 서체를 선택하고 활용 할 수 있는 능력을 기른다. 전통적인 타이포그래피 디자인의 이론과 적용방법을 바탕으로, 변화하는 디자인환경과 매체에 적용가능한 타이포그래피의 확장성을 탐구한다.",
    "credit": "전공필수",
    "price": 3,
    "grade": "1",
    "badge": null
  },
  {
    "id": 15,
    "title": "편집디자인 종합설계",
    "subtitle": "편집디자인종합설계는 “메시지”를 전달하기 위해 타이포그래피, 이미지 등 다양한 요소들을 사용하여 각 매체에 맞게 편집디자인으로 완성한다. 캡스톤디자인교과목으로 다양한 매체를 적용할 수 있다.",
    "credit": "전공선택",
    "price": 3,
    "grade": "전학년",
    "badge": null
  },
  {
    "id": 16,
    "title": "3D컴퓨터그래픽",
    "subtitle": "본 교과목은 시각적인 요소를 활용하여 3D그래픽 제작과정을 습득하고 다양한 소프트웨어 프로그램과 스킬을 배우는 수업입니다. 3D그래픽 제작의 기초 지식과 필요한 기술을 배우면서 표현 능력을 습득하고 연구합니다. 개인프로젝트를 통해 기획 및 제작과정을 알아가고 시각적 요소와 이론, 표현 기법을 배우는 수업입니다.",
    "credit": "전공선택",
    "price": 3,
    "grade": "3",
    "badge": null
  },
  {
    "id": 17,
    "title": "UX 디자인 방법론",
    "subtitle": "‘UX디자인 방법론’은 UX에 대한 개념을 바탕으로 수많은 하드웨어에서 범용적으로 쓰이는 UX/UI 방법론에 대해 습득한다. 이론수업 이 후 진행되는 프로젝트는 모바일을 비롯하여 웹, 태블릿, TV, 웨어러블 등 다양한 하드웨어에서 활용되는 UX/UI 디자인을 다루게 된다.",
    "credit": "전공필수",
    "price": 3,
    "grade": "3",
    "badge": "new"
  },
  {
    "id": 18,
    "title": "기초평면디자인",
    "subtitle": "2차원 평면으로 구성되는 시각 이미지의 구조와 다양한 표현방법을 탐구함으로써 시각 커뮤니케이션 디자인을 위한 아이디어 발상 및 효과적인 그래픽 연출의 기틀을 마련한다.",
    "credit": "전공필수",
    "price": 3,
    "grade": "1",
    "badge": "new"
  },
  {
    "id": 19,
    "title": "레이아웃 디자인",
    "subtitle": "레이아웃 디자인은 디자인 구성 요소를 어떻게 배치할지 결정하는 과정을 연구하는 수업입니다. 좋은 레이아웃 디자인은 사용자가 디자인 결과물을 쉽게 이해하고 사용할 수 있도록 합니다. 효과적인 배치로 쉬운 사용자 경험을 할 수 있도록 연구합니다.",
    "credit": "전공선택",
    "price": 3,
    "grade": "2",
    "badge": "new"
  },
  {
    "id": 20,
    "title": "서비스경험디자인",
    "subtitle": "서비스의 생태계를 바탕으로 이해관계자의 경험적 요소를 발굴하고, 이를 기반으로 서비스의 컨셉을 개발하는 방법을 학습한다. 발굴해 낸 서비스 컨셉을 바탕으로 브랜드를 설계하고 제공자의 수익가치를 창출하는 비즈니스 모델과 고객경험 가치를 구현하는 여정 기반의 청사진을 설계하는 방법을 학습한다.",
    "credit": "전공필수",
    "price": 3,
    "grade": "3",
    "badge": "new"
  },
  {
    "id": 21,
    "title": "디자인매니지먼트",
    "subtitle": "디자인을 하면서 실제 발생하는 문제들에 대해 이해하고 판단하여 문제를 해결하는 방법에 대해 연구하는 과목입니다.",
    "credit": "전공선택",
    "price": 3,
    "grade": "3",
    "badge": "new"
  },
  {
    "id": 22,
    "title": "패키지디자인",
    "subtitle": "패키지디자인은 시대적 트랜드와 발맞추어 지기구조를 포함한 입체구조를 분석하여 시각적으로 제품과 소비자를 연결시켜주는 그래픽 디자인과 함께 인터렉션이 가능한 방법적 커뮤니케이션을 연구한다.",
    "credit": "전공선택",
    "price": 3,
    "grade": "3",
    "badge": "new"
  },
  {
    "id": 23,
    "title": "소셜비즈니스마케팅",
    "subtitle": "나날이 변화하는 시대에 소비자 접근과 설득을 위한 문제해결 방법으로서, SNS 기반의 새로운 미디어를 이용한 광고전략과 프로모션 방법론을 익힌다. 다른 차원의 공간에서 구연할 수 있는 마케팅적 방법에 대해 알아본다.",
    "credit": "전공선택",
    "price": 3,
    "grade": "2",
    "badge": "new"
  }
  ,
  {
    "id": 24,
    "title": "영상디자인기초",
    "subtitle": "영상에 대한 기본적인 이해와 지식을 바탕으로 디자인의 기본 원리와 조형 요소 등을 충실히 적용하여 영상의 심미적 측면뿐만 아니라 디자인의 기능적 측면도 강조된 영상 콘텐츠 제작 역량을 함양하는 실습 중심의 교과목.",
    "credit": "전공선택",
    "price": 3,
    "grade": "2",
    "badge": "new"
  }
]
